{"id":490,"date":"2023-01-31T09:18:10","date_gmt":"2023-01-31T09:18:10","guid":{"rendered":"https:\/\/gioithieucongty2.ninhbinhweb.site\/?p=490"},"modified":"2023-01-31T09:18:10","modified_gmt":"2023-01-31T09:18:10","slug":"we-are-bringing-our-crypto-hardware-devices-to-all-best","status":"publish","type":"post","link":"https:\/\/gioithieucongty2.mauthemewp.com\/2023\/01\/31\/we-are-bringing-our-crypto-hardware-devices-to-all-best\/","title":{"rendered":"We are bringing our crypto-hardware devices to all Best"},"content":{"rendered":"<p>We are bringing our crypto-hardware devices to all Best Buy stores across the US starting today.<\/p>\n<p>Best Buy leverages a unique combination of tech expertise and human touch to meet customers’ everyday needs with over 900 stores in the United States.<\/p>\n<p>The Ledger Nano X and the Nano S Plus are now available for same-day pickup from Best Buy stores. Customers can pick up their Ledger within one hour across all Best Buy locations. There is no need to wait for delivery, anyone can start protecting their crypto and digital assets immediately.<\/p>\n<p>As part of an initial rollout, Ledger devices were already available in a select number of Best Buy stores across the United States. Ledger devices quickly sold out at multiple locations, and this in part led to the expansion to all stores. There is also a direct correlation between hacks and market volatility with an increase in the sales of hardware wallets.<\/p>\n<p>Best Buy saw a spike in Ledger sales after recent hacks such as the widely-publicized Solana wallet hack, and various bridge-related hacks. The heightened demand and interest around security also comes amidst the high-profile bankruptcy filings of exchanges such as Celsius and Voyager, and withdrawal halts from the likes of Hodlnaut. The importance of owning your own keys has never been so important.<\/p>\n<p>Pascal Gauthier, Chairman and CEO of Ledger, says: “<em>There has never been a more important time to truly own your digital assets. Too many hacks, too many people losing their money through no fault of their own. With Best Buy we are making it easier than ever for customers in the US to take security into their own hands. In just 1 hour anyone can stop themselves from getting rekt. Remember: not your keys, not your coins.”<\/em><\/p>\n<p>Select Best Buy locations will have interactive displays that will help educate customers on the different types of crypto storage and guide them through the process of hardware wallet activation through the Ledger Academy, a trusted crypto and Web3 education platform offered for free in nine languages.<\/p>\n<p>Ledger already secures many of the most valuable digital assets in the world — supporting 23 cryptocurrencies and more than 1,500 Ethereum scripted tokens. Forty-five out of the 100 top transactions on OpenSea and 40 percent of Bored Apes transactions are also secured by the platform.<\/p>\n<p>Now available in nine languages and shipping worldwide, Ledger’s mission is more important today than ever. Ledger gives users and creatives the most secure tools across Web3 in an environment where users increasingly face challenges using Web2 technology to protect Web3 value.<\/p>\n<p>Ian Rogers, Chief Experience Officer of Ledger, says <em>“Our partnership with Best Buy has already allowed many people to take security into their own hands. During the recent Solana wallet exploits, consumers flocked to Best Buy to pick up a Ledger Nano and take ownership over their crypto and digital assets. Now, with our partners Best Buy, we’re making that easier and faster than ever across the entire United States.”<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are bringing our crypto-hardware devices to all Best Buy stores across the US starting today. Best Buy leverages a unique combination of tech expertise and human touch to meet customers’ everyday needs with over 900 stores in the United States. The Ledger Nano X and the Nano S Plus are now available for same-day pickup from Best Buy stores. Customers&#8230;<\/p>\n","protected":false},"author":1,"featured_media":491,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/posts\/490"}],"collection":[{"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/comments?post=490"}],"version-history":[{"count":1,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/posts\/490\/revisions"}],"predecessor-version":[{"id":492,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/posts\/490\/revisions\/492"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/media\/491"}],"wp:attachment":[{"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/media?parent=490"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/categories?post=490"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/gioithieucongty2.mauthemewp.com\/wp-json\/wp\/v2\/tags?post=490"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}